{
  "Users": [
    {
      "id": 1,
      "username": "user1",
      "password": "pass1",
      "name": "Frodo",
      "favourites": [
        1,
        2,
        5,
        7
      ]
    },
    {
      "id": 2,
      "username": "user2",
      "password": "pass2",
      "name": "Bilbo",
      "favourites": [
        1,
        5,
        6,
        8
      ]
    },
    {
      "id": 3,
      "username": "user3",
      "password": "pass3",
      "name": "Darth Vader",
      "favourites": [
        1,
        2,
        6
      ]
    }
  ],
  "Blogs": [
    {
      "title": "Simple example of retrieving JSON feeds from Blogger Data API",
      "body": "This sample demonstrates displaying a list of recent posts from a blog hosted on Blogger Beta using the JSON output format provided by the Blogger Data API. This allows you to query a blog's public feed and get the resulting entries returned as JSON objects. To use the new JSON feed, create a script element whose src value is https://blogname.blogspot.com/feeds/posts/default?alt=json-in-script&callback=myFunc where blogname is the blog you want to retrieve, and myFunc is the name of your callback function that is passed the JSON object. For more information on JSON output support for Google Data APIs please see our JSON output support",
      "authorId": 1,
      "category": "Technology",
      "postedOn": "February 4, 2016 10:13:00",
      "id": 1
    },
    {
      "title": "Thor Ragnarok Is The Thor We’ve Been Waiting For",
      "body": "Thor Ragnarok is the third (and final?) installment for Thor in this phase of the Marvel Cinematic Universe. Thor has found himself imprisoned in a gladiatorial contest against his friend from work, The Hulk. He must fight and race against time to prevent the villain named Hela from destroying his home, Asgard.",
      "authorId": 2,
      "category": "Entertainment",
      "postedOn": "February 4, 2016 10:13:00",
      "id": 2
    },
    {
      "title": "You Can Stop Obsessing Over Expensive Quinoa And Switch To Desi Millets Instead",
      "body": "Customers eat plates of food at the Vaathsalya Millet Cafe in Bengaluru, India, on Saturday, June 10, 2017.\nAs buzzwords go, currently millets seem to be topping the list. We are talking about it, trying to cook it at home, and seeing them pop up on restaurant menus. We seem to be finally waking up to a load of goodness that's been growing in your backyards.\n\nMillets have always had a lot going for them, they are indigenous, score high on nutrition, and are classified as smart foods. \"Yet, with the Green Revolution, processing of rice and wheat became easier, resulting in them being readily available,\" says Agriculture Minister, Government of Karnataka (GoK), Krishna Byre Gowda, who has been a strong proponent of millets. The recent National Trade Fair organised in Bangalore by the GoK, with a focus on millets, saw large numbers of farmers, consumers, exhibitors and more participating.\n\n\"Rice became a symbol of aspiration as it signified socio-economic improvement. Added to that, the longer cooking times that millets have and the perception that it is a poor man's food, relegated it to the back burner,\" he added.",
      "category": "Medicine",
      "authorId": 1,
      "postedOn": 1510772722428,
      "id": 3
    },
    {
      "title": "GST Rates On 50 Items Of Mass Consumption Slashed To 18%",
      "body": "The GST rate on 50 items of mass consumption, that were in the 28 per cent tax slab, has been slashed to 18 per cent, Bihar Deputy Chief Minister Sushil Kumar Modi, who heads the panel of Group of Ministers for tackling IT-related glitches, said on Friday.\n\n\"All items of common consumption have been reduced from 28 per cent to 18 per cent tax rate. Tax on goods of mass consumption like chewing gum, chocolates, shaving items, shampoo and skin creams, whose revenue implication is not much, has been reduced,\" Modi told reporters on the sidelines of the Goods and Services Tax (GST) Council meet here.",
      "category": "Management",
      "authorId": 1,
      "postedOn": 1510779079363,
      "id": 4
    },
    {
      "title": "Ex-Facebook Chief Warns Site Was Built To Exploit People’s Weaknesses",
      "body": "In the wake of last year's U.S. election, in which Russian interference and \"fake news\" on social networks became major topics, many are rethinking the role of social media in our society.\n\nAdding their voice to the list of critics is Sean Parker, who in 2004 became the first person to serve as president of Facebook. During a talk in Philadelphia this week, Parker warned consumers that the social network, like other social media sites, was designed to exploit people's psychological vulnerabilities.\n\n\"God only knows what it's doing to our children's brains,\" said Parker, according to Axios.\n\nHe joked that his comments could get him barred from Facebook.",
      "category": "Technology",
      "authorId": 1,
      "postedOn": 1510779133792,
      "id": 5
    },
    {
      "title": "5 Hollywood Movies That Revolutionised The Heist Genre",
      "body": "There's something about a good cinematic heist that's hard to resist. Who doesn't love watching the intense, painstaking planning undertaken by the would-be robbers, the sheer audacity of the crimes they commit (remember Tom Cruise infiltrating CIA HQ in Mission: Impossible?) and the eventual, and often bloody, meting out of justice at the end?\n\nWhile Hollywood has produced many great heist movies over the years, the following movies revolutionised the heist genre with storylines, characters and film-making techniques that surprised and shocked us. They brought us face to face with our own deeply-hidden greed or anger, and made us question our own morals. They also gave us brilliant insights into the human mind, character, and the values that define our changing times. Here are the top 5 Hollywood heist films.",
      "category": "Entertainment",
      "authorId": 2,
      "postedOn": 1510779713020,
      "id": 7
    },
    {
      "title": "dsgd",
      "body": "kb",
      "category": "Technology",
      "authorId": 3,
      "postedOn": 1510829857554,
      "id": 8
    },
    {
      "title": "ZONES IN ANGULAR",
      "body": "Zones are a perfect fit for Angular\nIt turns out that, the problem that Zones solve, plays very nicely with what Angular needs in order to perform change detection in our applications. Did you ever ask yourself when and why Angular performs change detection? What is it that tells Angular “Dude, a change probably occurred in my application. Can you please check?”.\nBefore we dive into these questions, let’s first think about what actually causes this change in our applications. Or rather, what can change state in our applications. Application state change is caused by three things:\nEvents - User events like click, change, input, submit, …\nXMLHttpRequests - E.g. when fetching data from a remote service\nTimers - setTimeout(), setInterval(), because JavaScript\nIt turns out that these three things have something in common. Can you name it? … Correct! They are all asynchronous.",
      "category": "Technology",
      "authorId": 2,
      "postedOn": 1511115324790,
      "id": 9
    }
  ]
}